from telegram import ReplyKeyboardMarkup, InlineKeyboardMarkup, InlineKeyboardButton
from telebot import types

# InlineKeyboard (кнопки всередині повідомлення)
questions = types.InlineKeyboardMarkup(row_width=2)
categories = types.InlineKeyboardMarkup(row_width=2)
fractions = types.InlineKeyboardMarkup(row_width=2)
anomalyes = types.InlineKeyboardMarkup(row_width=2)
weapons = types.InlineKeyboardMarkup(row_width=2)
artifacts = types.InlineKeyboardMarkup(row_width=2)

questions.add(InlineKeyboardButton("Добре давай почнемо", callback_data="Добре давай почнемо")),
categories.add(InlineKeyboardButton("Фракції", callback_data="fractions")),
categories.add(InlineKeyboardButton("Аномалії", callback_data="anomalyes")),
categories.add(InlineKeyboardButton("Зброя", callback_data="weapons")),

fractions.add(InlineKeyboardButton("Одинаки", callback_data="loners")),
fractions.add(InlineKeyboardButton("Бандити", callback_data="bandits")),
fractions.add(InlineKeyboardButton("Військові", callback_data="regular_army")),
fractions.add(InlineKeyboardButton("Моноліт", callback_data="monolith")),
fractions.add(InlineKeyboardButton("Чисте небо", callback_data="clear_sky")),
fractions.add(InlineKeyboardButton("Долг", callback_data="duty")),
fractions.add(InlineKeyboardButton("Свобода", callback_data="freedom")),
fractions.add(InlineKeyboardButton("Найманці", callback_data="naymanci")),
fractions.add(InlineKeyboardButton("Ренегати", callback_data="renegates")),
fractions.add(InlineKeyboardButton("Вчені", callback_data="sciencist")),

anomalyes.add(InlineKeyboardButton("Електра", callback_data="electra")),
anomalyes.add(InlineKeyboardButton("Газованка", callback_data="gaz_water")),
anomalyes.add(InlineKeyboardButton("Жалкий пух", callback_data="pux")),
anomalyes.add(InlineKeyboardButton("Воронка", callback_data="vortex")),
anomalyes.add(InlineKeyboardButton("Газ", callback_data="gaz")),
anomalyes.add(InlineKeyboardButton("Жарка", callback_data="hot")),
anomalyes.add(InlineKeyboardButton("Каруселя", callback_data="carousel")),
anomalyes.add(InlineKeyboardButton("Кисіль", callback_data="jelly")),
anomalyes.add(InlineKeyboardButton("Кислотний туман", callback_data="acid_fog")),
anomalyes.add(InlineKeyboardButton("М'ясорубка", callback_data="meat_grinder")),
anomalyes.add(InlineKeyboardButton("Оаза", callback_data="oasis")),
anomalyes.add(InlineKeyboardButton("Плавні", callback_data="plawni")),

weapons.add(InlineKeyboardButton("ПМ", callback_data="PM")),
weapons.add(InlineKeyboardButton("ПБ", callback_data="PB")),
weapons.add(InlineKeyboardButton("Фора 12", callback_data="fora_12")),
weapons.add(InlineKeyboardButton("УДП компакт", callback_data="Udp_compact")),
weapons.add(InlineKeyboardButton("Кора 919", callback_data="Kora_919")),
weapons.add(InlineKeyboardButton("Марта", callback_data="Marta")),
weapons.add(InlineKeyboardButton("Волкер-П9м", callback_data="Volker_p9m")),
weapons.add(InlineKeyboardButton("СІП-т м200", callback_data="SIPT_M200")),
weapons.add(InlineKeyboardButton("Чорний яструб", callback_data="Black_hawk")),
weapons.add(InlineKeyboardButton("Гадюка 5", callback_data="Gaduka_5")),
weapons.add(InlineKeyboardButton("Обріз", callback_data="Sawed_off_shotgun")),
weapons.add(InlineKeyboardButton("Мисливська рушниця", callback_data="Hunters_rifle")),
weapons.add(InlineKeyboardButton("Чейзер 13", callback_data="Chaser_13")),
weapons.add(InlineKeyboardButton("СПСА 14", callback_data="SPSA_14")),
weapons.add(InlineKeyboardButton("Відбійник", callback_data="Bouncer")),
weapons.add(InlineKeyboardButton("Гадюка 5", callback_data="Gaduka_5")),
weapons.add(InlineKeyboardButton("АКМ 74 2/У", callback_data="AKM_74_2U")),
weapons.add(InlineKeyboardButton("АКМ 74 2", callback_data="AKM_74_2")),
weapons.add(InlineKeyboardButton("АС ВАЛ", callback_data="AS_VAL")),
weapons.add(InlineKeyboardButton("ТРС 301", callback_data="TRS_301")),
weapons.add(InlineKeyboardButton("ІЛ 86", callback_data="IL_86")),
weapons.add(InlineKeyboardButton("Грім 314", callback_data="Grom_314")),
weapons.add(InlineKeyboardButton("Абакан", callback_data="Abakan")),
weapons.add(InlineKeyboardButton("ГП 37", callback_data="GP_37")),
weapons.add(InlineKeyboardButton("СГІ_5к", callback_data="SGI_5k")),
weapons.add(InlineKeyboardButton("ФТ 200м", callback_data="FT_200m")),
weapons.add(InlineKeyboardButton("ВСС Винторез", callback_data="VSS_Vintorez")),
weapons.add(InlineKeyboardButton("СВУмк 2", callback_data="SVUmk_2")),
weapons.add(InlineKeyboardButton("Гаусс пушка", callback_data="Gauss_gun")),
weapons.add(InlineKeyboardButton("Бульдог-6", callback_data="Bulldog_6")),
weapons.add(InlineKeyboardButton("РПГ-7У", callback_data="RPG_7U")),
weapons.add(InlineKeyboardButton("РПГ-7У", callback_data="RPG_7U")),
weapons.add(InlineKeyboardButton("РГД-5", callback_data="RGD_5")),
weapons.add(InlineKeyboardButton("Ф-1", callback_data="F_1")),
weapons.add(InlineKeyboardButton("РП-74", callback_data="RP_74")),


 # ====== УГ{РУПУВАННЯ ====== #

loners= {
     "name": "Одинаки",
     "text": "Сталкери (також одинаки, вільні сталкери або нейтрали) — люди в Зоні, котрі не перебувають в жодному з наявних угрупувань"
     " і зазвичай діють поодинці або невеликими групами непостійного складу. Складають, очевидно, більшу частину контингенту Зони."
     "Сталкерів в Зону тягнуть найрізніші мотиви: збагачення, жага до пригод або дослідження невідомого, прагнення почати нове життя. Деякі з часом можуть приєднатись до таких угрупувань як «Долг» або «Воля»,"
     " але більшість сталкерів бажають бути хазяїнами самі собі й нікому не коритися, зберігаючи нейтралітет з усіма угрупуваннями."
     "Головний прибуток більшість сталкерів отримують з продажу хабара: артефактів, частин мутантів, мародерства. Доволі часто гроші може принести виконання завдань торговців, вчених, представників угрупувань та інших сталкерів."
     "Основні угрупування (окрім найманців, «Моноліту», бандитів та військових) співпрацюють з сталкерами і знаходяться з ними в нейтрально-дружніх відносинах, тому як саме одинаки поповнюють їх ряди."
     "Сталкери були цільним угрупуванням до другого Великого Викиду. Про це свідчить наявність бази, лідера, а також можливість повноцінно вступити до них та вести за них війну. Після подій ЧН, ймовірно, були знищені бандитами або військовими, після чого одинаки розсіялись по Зоні вирішивши не засновувати головну базу. Селище новачків військові не чіпають, тому як знаходяться в хороших "
     "відносинах власне зі мною."
 },
bandits={
     "name": "Бандити",
     "text": "Бандити (також крадуни, або блатні) — представники кримінального світу, які пЫрийшли до Зони через різні причини: заробити на продажі артефактів, сховатися від закону, купити або продати зброю. У Зоні багато подібного елемента рівнем від шпани до серйозних кримінальників. Здебільшого об'єднані у банди."
     "Хоча єдиної бандитської організації в Зоні й досі немає, ці елементи становлять серйозну проблему для звичайних сталкерів."
     "У бандитів дуже проста ідеологія — вони, за своїм затвердженням, охороняють вільних сталкерів, а ті повинні їм платити за так званий «дах». Якщо особа відмовляється платити гроші, то у хід йде зброя, і звичайна вимога переходить у грабунок."
     "Мають щось на кшталт власного кодексу честі — так звані «поняття», що діють у бандитів за межами Зони та навіть у в'язницях."
     "Озброєні як вітчизняною, так і зброєю західних зразків. Чим ближче банда до Центру Зони, тим краще озброєні її члени. На Кордоні та Смітнику бандити озброєні слабкими пістолетами, обрізами, рушницями і пістолетами-кулеметами типу Гадюка-5. Члени банд з Темної долини, Дикої території і Лиманська озброєні набагато краще — в їх руках можна "
     "побачити такі автомати, як АКМ-74/2У, АКМ-74/2 і навіть СА «ЛАВИНА», кулеметники використовують РП-74. З пістолетів зустрічаються ХПСС-1м і Марта, із дробовиків — Чейзер-13, СПСА-14 та Відбійник."
     "Бандити-новачки носять куртки із вшитими броньовими елементами. Більш досвідчені злочинці та лідери банд одягають шкіряні плащі, виключно через зовнішній вигляд — ні від куль, ні від аномалій вони нормально не захищають. І, нарешті, віддані військовій справі бандити, яких часто посилають на зачистку"
     "територій та лігвищ мутантів, носять модифікований комбінезон найманців — це єдиний бронежилет угруповання."
 },
Regular_army = {
     "name": "Військові",
     "text": "Військові, також військові сталкери — військовослужбовці регулярних бойових частин Державної служби охорони МВС України. Охороняють периметр Зони, нерідко здійснюють рейди всередину периметра. Добре навчені і озброєні."
     "Військові охороняють Зону від несанкціонованого проникнення сторонніх осіб. Будь-яка особа, що незаконно потрапила в зону екологічного лиха повинна бути заарештованою або ліквідованою. Службовцям надано право стріляти без попередження, тому військові блокпости краще обходити 'десятою дорогою', оскільки до сталкерів, як і до інших порушників, зазвичай, вони ставляться вороже."
     "В реальності стан справ такий, що військових можна підкупити, якщо вони не проводять спецоперацію і поруч немає керівництва. Допомагають ученим, які офіційно працюють в Зоні, мають добрі відносини з «Долгом», хоча іноді і конфліктують."
     "Службовці одягнені в надійні армійські бронежилети. Озброєні практично всіма зразками 'вітчизняної' зброї, які нерідко списують і 'передають' нелегальним формуванням Зони за гроші або артефакти. Також, зрідка, у торговців можна за немалі кошти купити відмінні комплекти армійської броні. Кадрові офіцери, а також особовий склад військових патрулів (з солдатів і сержантів) озброєні АКМ-74/2У,"
     " рідше АКМ-74/2 і носять стандартні армійські бронежилети, що пробиваються автоматною кулею на середній дистанції. "
     "Спецпідрозділи військових екіпіровані згідно специфіки завдання: загони зачистки носять посилений бронежилет «Берил-5М» і озброєні АС-96/2, загони для глибокого рейду в Зоні носять важкі бронекостюми «Булат» і озброєні «Громами» або СА «ЛАВИНА». Для оборони важливих об'єктів нерідко використовують кулемет РП-74."
                 },
monolith = {
     "name": "Моноліт",
     "text":"«Моноліт» — фанатичне угруповання з Центру Зони, що контролює підходи до ЧАЕС та Саркофагу. Насамперед бійці захищають свою реліквію — Моноліт, серед сталкерів більш відомий як «Виконавець бажань»."
     "Релігійне угрупування, яка знаходиться в центрі Зони не підпускаючи до себе нікого. Монолітовці люто ворогують зі всіма іншими угрупуваннями. Члени угрупування не піддаються псі-випромінюванню та викидам. Мовчазні, не йдуть на контакт, відрізняються фанатичною прихільністю до того, що знаходиться в центрі Зони. Їх прихильність стала релігійним культом, обов'язковим для всіх членів угрупування."
     "Вірять в те, що Зона жива. Сталкери, не бажають зустрічатися з 'релігійними фанатиками', як їх прийнято називати. Монолітовців вважають зацикленими на їх фанатичності, але їх супротив спробам проникнути в Центр Зони говорить про їх силу та досвід."
     "Наявність у монолітовців першокласної зброї на основі передових технологій, важкого обмундирування і їх фанатична рішучість дає свої результати"
     "Найчисленніше, не враховуючи військових, угрупування (близько 500 членів). Основна ідея «Моноліту» тримається на кристалі позаземного походження, який сприймається ними як божество. Монолітовці піддаються й моляться йому, збираючи своєрідні макети зі сміття, які одночасно виконують функцію антен-передавачів, побачити їх можна у Прип'яті на місці стоянок Моноліту."
     "Члени культу не підтримують відносини з жодним з угрупуваннь, але можна побачити, що монолітовці нейтрально ставляться до зомбованих сталкерів, вважаючи їх своїми братами. Інших сталкерів вони вважають невірними та знищують."
     "Угрупування «Моноліт» — одне з найстаріших, було утворене з тих сталкерів, що повірили в силу загадкового артефакту - кристалу під назвою Моноліт, котрий, начебто, виконує бажання. Спочатку вони були формуванням з метою захисту Зони від непроханих гостей та пошуку того самого Моноліта."
     "Перед Сверхвикидом вони всі пішли в Центр Зони, минаючи 'Випалювач', для пошуку моноліту, відтоді їх довго ніхто не бачив. Через якийсь час сталкери почали помічати агресивно налаштованих членів угрупування, які не йшли на перемовини та атакували всіх."
     "Потім стане відомою причина трансформації «Моноліту» в клан безглуздих фанатиків: угрупування було зомбовано вченими 'о-Свідомість' для захисту від сталкерів, котрі намагаються проникути на ЧАЕС і до лабараторій о-Свідомості'. Членів угрупування контролювали за допомогою антен, найбільшою з яких є 'Випалювач мізків'."
     "Після того, як в 2012 році Стрілець вимкнув Випалювач, а потім знищив 'о-Свідомість', багато монолітовців почали випадати з поля контролю цих антен. В підсумку, багато хто з них стали простими зомбованими, і лише мала частина змогла повернути свою особистість, як Бродяга і його загін."
     "Угрупування «Моноліт» має успіх в закупівлі найбільш нового і потужного озброєння та екіпірування. Озброєння представлене як вітчізняними, так і закордонними зразками, з яких обираються найкращі. Ведеться закупівля снайперських гвинтівок СВДм-2 та СВУмк-2, новітнього автоматно-гранатометного комплексу ФТ-200М, ракетометів РПГ-7у та кулеметів РП-74, але найважливіше — наявність у майстрів угрупування 'Виробу №62', більш відомого, як Гаусс-гармата."
     "Монолітовців тільки з пістолетами можна зустріти лише в ТЧ під час захисту Бар'єру. Пістолетами будуть користуватиться ракетометники, якщо підійти до них впритул, теж саме зі снайперами з СВДм-2."
     "Також монолітовці у великій кількості закуповують екзоскелети та костюми СЕВА, в конструкцію яких додають невідомі матеріали, міцніші та легші за 'звичайні' аналоги. Комбінезони угрупування мають камуфляж на основі Urban (сіро-білий фон з темно-сірими плямами)"
     "Скоріш за все, їх комбенізони мають сильний захист від радіації, бо багато їх снайперів займають місця з високим радіаційним фоном. В цілому, сталкери повинні визнати, що по кількісті і якості екіпірування «Моноліту» вони ні чим не поступаються найманцям і військовим."}
clear_sky = {
     "name":"Чисте небо",
     "text":"«Чисте небо» — це таємниче угруповання сталкерів-дослідників Зони, що переховується від сторонніх очей на Болотах. Історії цього угруповання присвячена гра S.T.A.L.K.E.R.: Чисте Небо."
     "Розпалося після другого Великого викиду у 2011 році. Деякі бійці, що вижили, де не де з’являються, але приховують свою причетність до «Чистого неба».",}
duty = {
     "name":"Долг",
     "text":"«Долг» (укр. Обов'язок) — воєнізоване угруповання, створене колишніми військовими та добровольцями. Від них залишився статут, сувора дисципліна й ціль — захист світу від Зони."
     "Воєнізоване угруповання, що вважає своєю головною метою захист зовнішнього світу від Зони та подальше її знищення."
     "Представники «Долгу» не торгують унікальними породженнями Зони: подейкують, усі знайдені цими людьми артефакти передаються вченим."
     "Добре озброєні та треновані, за підготовкою наближені до найманців. Більшість операцій угруповання пов'язані із винищенням монстрів, тому рейди «Долгу» часто рятують звичайних сталкерів від багатьох проблем."
     "Давно і люто ворогує з угрупованням «Воля», ідеологія якого є прямою протилежністю «Обовв'язку»."
     "На думку деяких сталкерів «Долг» фінансується урядом, це підкріплює те що в угрупуванні є багато дезертирів, і однією цілью з військовими - стримування та знищення Зони."
     "Але, не дивлячись на це, «Долг» та військові часто конфліктують у сутичці один з одним. Через різний світогляд на зону конфліктують з угрупованням «Воля». На думку багатьох сталкерів є найсильнішим угрупованням у зоні."
     "Відомо, що «Долг» не має справ з торговими представниками Зони, а всі знайдені артефакти продають вченим, за необхідності отримуючи у них необхідне спорядження."
     "Приблизно в 2006 році — угруповання засновує капітан Таченко, під час однієї з перших військових експедицій до Зони, тоді загін Таченко поніс втрати, зустрівшись віч на віч із жахами Зони - і капітан вирішив обірвати зв'язок з командуванням та запропонувати своїм бійцям створення «Долгу». Сам капітан оголошує себе генералом «Долгу»."
     "Можливо, це сталося під час операції, в ході якої планувалося підірвати в центрі Зони тактичну ядерну зброю. Також, одним з ймовірних співзасновників «Долгу» є саме майор Звягінцев, який розповідає про те, що в 2006 році командував одним із спецзагонів військових, який було знищено породженнями Зони, а сам він місяць блукав її теренами, доки не зустрівся з, ймовірно, групою Таченко, після чого доєднався до неї."
     "Також, під час однієї з таких перших експедицій (а можливо все тієї ж), майбутній генерал «Долгу» Крилов, який за словами все того ж Звягінцева, був високопоставленим військовим, також був кинутий напризволяще військовим керівництвом, після чого з ненавидів своїх колишніх колег, і доєднався до Таченко. Втім, зв'язки зі спецназом у Крилова лишилися."
     "Генерал Таченко керував угрупованням, ймовірно, до 2011 року. Пізніше Таченко із невеликим загоном зник, як потім стало відомо він помер у просторовій аномалії."
     "Паралельно із «Долгом» в них почав з'являтися серйозний супротивник — «Воля». Воно й не дивно, оскільки ідеології цих угруповань суттєво відрізняються. Також «Долг» починає боротьбу з бандитами. угруповання збільшується за рахунок поповнення рядів Одинаками та колишніми військовими."
     "2011 рік — Генерал Крилов займає пост лідера «Обов'зку», їх база знаходиться на НДІ «Агропром». Починається війна угруповань. У результаті надпотужного викиду відкривається дорога до Лиманську. Загін «Долгу» заходить до міста після знищення загону ренегатів, але там зустрічається з сильним спротивом з боку «Волі» та «Моноліту»."
     "Під час другого надпотужного викиду, після втрати позицій у Лиманську,«Долг» змушений перенести базу на територію заводу «Росток», де угруповання стає на захист новосформованого бару «100 рентген». Генерал Крилов зникає, ймовірно загинув під час перенесення основної Бази на інше місце дислокації."
     "2012 рік — В 2012 році керівництво угрупованням бере на себе генерал Воронін. Війна з «Волею» перейшла у фазу 'збройного нейтралітету', а з бандитами продовжується. Організовуються барикади для перекриття потоку мутантів з Темної Долини до Бару."
     "В той же час Череп намагається знищити вожака «Волі» Лукаша, не дивлячись на те, що генерал Воронін відмовляється від цієї операції.Після відкриття дороги на Північ (відімкнення Випалювача мізків Стрільцем) загони «Долгу» під керівництвом підполковника Шульги дісталися до Юпітеру,"
     " де після збройної конфронтації із загонами «Волі» заключили черговий 'збройний нейтралітет', аби сховатися від Викиду на території залізничної станції 'Янів', яку вони поділили між собою на дві половини та, тим самим, створили потужний сталкерський табір на Юпітері."}
freedom = {
     "name": "Свобода",
     "text": "Анархісти та шибайголови, які оголосили себе борцями за волю на території Зони й тому постійно конфліктують з армійськими підрозділами, військовими сталкерами та угрупованням «Долг»."
     "«Воля» вважає, що інформацію про Зону не можна приховувати від людства і в такий спосіб заперечує монополію урядових організацій на володіння тутешніми таємницями та дивами."
     "На емблемі угруповання зображений вовк — символ волі та незалежності, а також герб та прапор України."
     "«Воля» — анархістське угрупування, в основному складається з вільних сталкерів. Ціль угрупування — зберегти Зону як вільну територію та протистояти монополії влади. По словам Локі, верхівка угрупування складається з колишніх хіппі, хоча угрупування й називає себе анархітськім."
     "Угрупування не має «жорсткої» іерархії, але під час виконання завдання всі бійці повинні слухати старшого по званню. Представники «Волі» вважають що Зону неможливо знищити — з нею можливо і потрібно співіснувати. Зона — чудова можливість для дослідження та вивчення, і вона не повинна бути територією військових."
     " Також «Воля» вважає, що Зону не можна приховувати від світу. Вони бажають «встряхнути» людей на «Великій Землі», щоб ті дізнались правду. «Воля», по словам самих членів угрупування, також досліджує Зону і її творіння, наприклад, роблять заміри радіаційного фону, температури, вологості, присутність монстрів й аномалій."
     "Члени угрупування використовують свій сленг, який представляє собою запозиченні слова з інших мов, частіше всього з англійської. У угрупування є особисті постачальники, завдяки яким «Воля» і отримує костюми й зброю."
     "війна угрупуваннь — на момент 2011 року угрупування є найбільш чисельним. В результаті Великого викиду для дослідження стає доступним місто Лиманськ. Загін «Волі» направляється туди, але зустрічає супротив бійців «Долгу» та «Моноліту». Разом з цим «Воля» воює з найманцями на территорії Темної Долини. Після другого Великого викиду, втративши загін в Лиманську, «Воля» вирішує переміститись ближче до Центру Зони, захопивши Військові Склади. Захистом Барьєру починає займатись «Воля», маючи хороше стратегічне положення на шляху до Центру Зони."
     "угрупування закріпилося на Військових Складах. Після того, як Стрілець вимикає Випалювач, загони «Волі» направляються до Центру Зони, але там стикаються з загонами «Долгу». В результаті один із загонів під керівництвом Локі закріпляється на Яніві, де установлюється нейтралітет між бійцями угруповань."}
naymanci = {
     "name": "Найманці",
    "text": "Найманці — найзагадковіше і найпотаємніше угрупування в Зоні, скоріше навіть не угруповання, а синдикат, в якому є свої загони, спрямовані на вирішення певних завдань, в існування якого багато хто навіть не вірить."
     "Тим не менш, дехто постійно користується послугами найманців: професіонали своєї справи, вони швидко усунуть будь-якого сталкера і навіть можуть повністю ліквідувати невелике угруповання. За свої послуги, вони беруть чималі суми в грошах чи артефактах."
     "Розташування бази цього угрупування до сих пір залишається загадкою; очевидно, вона знаходиться десь у глибині Зони. Ходять чутки, що основна база найманців розташована в Мертвому місті (в руїнах двоповерхівки) руїни якого знаходяться на північ від Дикої Території і на захід від Військових складів. Найбільша активність найманців відзначається саме в західній частині території заводу Росток, іще у 2011 році лідер угруповання сталкер Тесак."
     "Найманці не ведуть війни з якими-небудь угрупуваннями цілеспрямовано - вони просто нікого не підпускають близько до себе і вбивають всіх, хто може встати у них на шляху. Більшість сталкерів це добре знають і вважають за краще з ними не зв'язуватися, однак при нагоді стріляють на ураження, бо добре розуміють, що якщо не уб'ють вони, то найманці швидко і професійно покінчать з ними."
     "Найманці, всупереч поширеній думці, не просто звичайні кілери. Вони виконують на замовлення найрізноманітніші доручення. Це може бути не тільки вбивство, але і видобуток рідкісного артефакту, устаткування, супровід інших цінних вантажів або клієнтів в певне місце через найнебезпечніші території Зони і багато іншого, про що більшості просто невідомо. Головне, що відрізняє найманців від інших сталкерів - це високий професіоналізм і якість надаваних ними послуг, за що їх, власне і цінують."
     "Діють найманці вкрай обережно і приховано, безжально знищуючи всіх небажаних свідків своєї діяльності."
     "Ті ж, кому пощастило зіткнутися з найманцями і якимось неймовірним чином вижити стверджують, що найманці носять сіро-блакитні захисні комбінезони невідомої моделі і озброєні найкращими зразками європейського озброєння."
     "На тілах убитих найманців часто виявляють дуже вартісне обладнання і не менш коштовні й потужні артефакти, попри це при собі у найманців ніколи не знаходили ніяких особистих речей."
     "Чітко спланована операція і відмінна підготовка - ось запорука їх успіху. Найманці дуже серйозно ставляться до своїх завдань і до роботи в цілому. У них є власний кодекс, на якому, за їх твердженням, все і тримається. З цього кодексу відомо найголовніше правило - будь-який контракт повинен бути виконаний. Провалити завдання значить зіпсувати репутацію угрупування, а після цього жоден серйозний замовник більше до нього за допомогою не звернеться."
     "У плані різноманітності бронежилетів, угрупування найманців - 'найбідніше'. Представники угрупування носять лише два види - Комбінезон найманця і екзоскелет. Проте в їх справі головне не кількість, а якість. Обидва бронежилета добре захищають від куль і вибухів, але у полі з різноманітними аномаліями ці костюми не нададуть майже ніякого захисту."
     "Найманці дуже добре озброєні, це і є одна з причин, чому з ними краще не перетинатися. Ймовірно, мають зв'язки з чорним ринком, звідки і ведуться поставки озброєння. Переважно це зброя західних зразків, таких як ІЛ86, ТРс-301 і СГІ-5к."
     "Так звані 'новачки' можуть носити пістолет-кулемет Гадюка-5 або дробовик СПСА-14. Майстри угруповання полюбляють ГП37. Практично на кожну одиницю зброї найманці встановлюють глушник, адже іноді потрібно проводити операцію по-тихому. Головне, щоб дуло було потрібної форми. Те ж саме з оптичними прицілами. Підствольними гранатометами не користуються, кидають тільки ручні гранати."}
renegats = {
     "name": "Ренегати",
     "text": "Ренегати — нечисленне угруповання, що складається виключно з наймерзенніших особистостей Зони. Бандити, мародери, зрадники — колишні члени інших угрупувань, що змінили і зрадили ідеї власних кланів."
     "Це угруповання не має організованої структури і лідера як такого. Збиваючись в невеликі групи, полюють за легкою здобиччю, промишляючи вбивствами і грабунком, як правило, молодих і недосвідчених сталкерів. Найчастіше зустрічаються вздовж периметра Зони."
     "Ренегати не мають абсолютно ніяких обмежень і законів. Вони визнають лише право сильного, нападаючи на всіх, з ким можуть впоратися. Зібране з покидьків суспільства, це угрупування не зупиняється ні перед якими перешкодами. Регулярно поповнюючись зрадниками і відступниками, розрізнені загони «ренегатів» готові вчепитися в горлянку кожному, хто є слабшим за них."
     "Лише бажання вижити змусило шакалів Зони тимчасово об'єднатися перед обличчям спільного ворога. Вони готові вчинити будь-який, навіть найаморальніший вчинок, якщо він принесе їм вигоду."
     "У плані озброєння і екіпіровки ренегати майже повністю ідентичні бандитам. Залежно від рангу та досвіду, носять бандитські куртки, шкіряні плащі та бандитські комбінезони. Вони користуються більшою мірою обрізами, рушницями і слабкими пістолетами, частенько кидаючи наступальні гранати. У більш просунутих ренегатів є Гадюка-5. У банд ближче до Центру Зони є така зброя, як АКМ-74/2, СА «ЛАВИНА», Грім-С14, тощо."}
sciencist = {
    "name": "Вчені",
     "text": "Вчені — дослідники природи Зони та її породжень. За гарних відносин з їхнього боку вдалий сталкер може добре збути знайдений у Зоні хабар вченим без торгівця-посередника. Також іноді можуть найняти сталкера для виконання певного завдання."
     "Як дослідники ЧЗВ з'явилися після Другої катастрофи, приблизно, в 2006 — 2007 роках. Звичайнісінькі вчені, які вивчають Зону. Працюють і мешкають в мобільних лабораторіях. Незважаючи на глибокі пізнання, на практиці в польових умовах майже безпорадні, тому "
     "змушені користуватися послугами сталкерів. Польове екіпірування — комбінезони ССП-99 «Еколог» та ССП-99М, рідко — комбінезон «СЕВА». Вчених цікавить практично все, що пов'язане із Зоною — Аномалії, Мутанти, Явища. Кожен Еколог має при собі табельну зброю, найчастіше це Волкер-П9м або малогабаритна автоматична зброя, що"
     "пов'язано з тим, що не кожен вчений проходив підготовку володіння вогнепальною зброєю."
 }

# #==== Аномалії ====#


electra =  {
     "name": "Електра",
     "text": "Аномальне утворення діаметром близько 10 метрів, що накопичує статичну електрику. Потривожена аномалія вибухає десятком міні-блискавок, причому враження струмом для будь-якої живої істоти майже завжди закінчується смертю."
     "Характерною рисою «Електри» є наявний над нею вдень блакитнуватий туман. Уночі легко виявляється будь-якими видами детекторів або за допомогою кидання металевих предметів."}
gaz_water = {
     "name": "Газованка",
     "text": "Цю аномалію складно помітити здалеку, проте, при наближенні до неї людина перестає розрізняти всі кольори, крім зеленого. При активації 'газована вода'"
     "викидає на поверхню хмару отруйних газів, що може завдати великої шкоди живому організму. При цьому, аномалія видає звук, схожий на шипіння, за це вона і отримала свою назву."
     "Зустрічається тільки на півночі Зони, часто в сукупності з іншими аномаліями хімічної природи. "
 }
pux = {
     "name": "Жалкий пух",
     "text": "Аномально видозмінена рослинність. За швидкого наближення живої істоти викидає хмарку часток, котрі у випадку контакту із відкритою або слабко захищеною шкірою можуть завдати"
     "серйозних травм. На об'єкти, що рухаються повільно, не реагує. Утворює три види артефактів (можливо, це насіння): «Колючку», «Кришталеву колючку», «Морського їжака»."
 },
vortex = {
     "name": "Воронка",
     "text": "Аномалія, що ймовірно має гравітаційну природу. На момент активізації зі страшною силою втягує до себе все, що знаходиться у радіусі 10-15 м."
     "За потрапляння до центру «Воронки» шансів вижити немає: тіло і тварини, і людини буде стиснуте у маленьку грудку, а потім розірвано у момент так званої розрядки."
     "Протягом усього періоду існування - в середньому це близько тижня - аномалія не змінює місця свого прояву;"
     "може бути візуально виявлена вдень за характерним рухом потривоженого повітря над нею, кружлянням опалого листя, фрагментам розчленованих трупів та характерній"
     "темній плямі на землі у центрі. Уночі вкрай небезпечна, оскільки може бути виявлена лише детекторами або за допомогою кидання металевих предметів."
 }
gaz = {
     "name": "Газ",
     "text": "'Лоза' - химерна аномалія, що нагадує виноградну лозу, провислу між будинками в Прип'яті. Аномалія небезпечна 'Газировками' на землі та у ямі (де, імовірно, знаходяться самі"
     "корені лози), а по гілках - літаючою згори 'Кислотною (Хімічною) кометою'. Однак, у ямі можна зрідка знайти деякі артефакти; також можна"
     "піднятися на саму гілку і проявивши дива еквілібристики, дійти до балкону на останньому поверсі, то можливо відхопити, наприклад, артефакт 'Колобок'. Істотним полегшенням для сталкера, який вирішив підкорити 'Лозу' є те, що 'кислотна комета' знаходиться в постійному русі і"
     "переміщується гілками виноградної лози. У підсумку можна простежити частоту, з якою комета проходить той чи інший відрізок шляху і досить 'безпечно' пройти до балкону. Вночі ж 'Лоза' справляє незабутнє враження на всіх, хто ії спостерігає. "
 }
hot = {
     "name": "Жарка",
     "text": "Жарка (Смалка) - поширена термічна аномалія в Зоні. У неактивному стані виглядає як ледь помітна хмара гарячого повітря, однак за потрапляння до зони дії будь-якого предмету"
     "або живої істоти утворює компактну зону (факел або вогняний гейзер), розігріту до температури близько 1500К. Вночі може бути виявлена ​​тільки потужними детекторами або за допомогою кидання металевих предметів."
     "Утворює шість видів артефактів: 'Краплі', 'Вогняна куля', 'Кристал', 'Око', 'Мамине намисто' і 'Полум'я'."
     "Смалка створює потужний стовп високотемпературного полум'я, що спалює жертву заживо."
     "При великому скупченні Смалок повітря нагрівається до дуже високих температур, в результаті чого можна отримати шкоду, перебуваючи за межами Смалки, або просто перебуваючи поруч зі скупченням аномалій."
     "Якщо Смалка утворилася в місці, звідки витікають ґрунтові води, аномалія стає більш помітною. Вода, що викидається аномалією, перетворюється на пару, яка піднімається вгору і утворює хмару гарячої пари."
 }
carousel = {
     "name": "Каруселя",
     "text": "Назва обумовлена ефектом підняття у повітря будь-якої живої істоти із подальшим розукручуванням до величезної швидкості."
     "Природа «Каруселі» поки не досліджена до кінця. Може бути виявленою за легеньким пиловим вихором та розкиданими фрагментами тіл навколо."
     "Дуже важливо не проґавити момент початку втягування до аномального вихору і не потрапити до зони максимально сильного ефекту в центрі - тільки тоді є шанс відбутися мінімальними травмами."
 }
jelly = {
     "name": "Кисіль",
     "text": "Аномалія, також відома як «Холодець», або «Відьмин Студень». Утворення не зрозумілої до кінця природи. У випадку контакту із тілом завдає травм, за ефектом подібних до впливу сильної кислоти. Утворює три види артефактів: «Слиз», «Слимака», «Слюду»."
  }
acid_fog = {
     "name": "Кислотний туман",
     "text": "Димчасте щільне скупчення кислотних газів, малопомітне вдень і чітко проявляється вночі. здалеку нагадує низькостелений радіаційний туман, з якого вертикально викидаються снопи іскор."
     "При безпосередньому контакті викликає сильні хімічні опіки. Аномалія тісно пов'язана з заболоченою місцевісцю, і, як правило, формує артефакти органічного походження."
 }
meat_grinder = {
     "name": "М'ясорубка",
     "text": "Гравітаційна аномалія, ледь помітна оком - сфера, в якій діють різноспрямовані фізичні сили, здатні розірвати або розплющити будь-яку істоту, що потрапила всередину."
     "Ця архі-аномалія, ледь помітна оком. Являє собою сферу. Від інших аномальних утворень гравітаційної природи відрізняється насамперед великим розміром і потужністю, "
     "а також тим, що в «м'ясорубці» діють різноспрямовані фізичні сили, здатні як розірвати, так і розплющити будь-який об'єкт, що потрапив у зону дії аномалії."
 }
oasis = {
     "name": "Оаза",
     "text": "Оаза — унікальна аномалія Зони, що чине лише позитивний вплив: при контакті відновлює здоров'я, зупиняє кровотечу, зменшує опромінення організму та навіть втамовує голод."
 }
plawni = {
     "name": "Плавні",
     "text": "Затока за цементним заводом. У цьому місці затока перетворилась на страшне смердюче болото, там повно 'газованої води'. Хоча, яка там вже вода, — майже суцільна кислота. "
     "Артефакти там знаходили. Проте кажуть, що це місце і монстрам дуже подобається. Особливо облюбували це місце кровососи"
 }


 #==== Зброя ====#
PM = {
     "name": "ПМ",
     "text": "Найпоширеніший пістолет у Зоні, дуже зручний у використанні. Поєднує в собі дуже малу потужність з великою надійністю. Є основною зброєю усіх сталкерів-новачків, починаючи з військових та закінчуючи бандитами."
     "Поширені набої 9х18 мм ПМ, які можна знайти в будь-якому кутку Зони. Вважається найкращим пістолетом для початківців, оскільки має низьку віддачу і достатню для ближнього бою потужність."
 }

PB = {
     "name": "ПБ",
     "text": "Цей пістолет було розроблено у другій половині XX сторіччя на базі пістолету ПМм для озброєння розвідувальних груп та персоналу спецслужб. Зазначена модель вважається морально застарілою, але в умілих руках вона, як і раніше, є вельми ефективною зброєю."
 }

fora_12 = {
     "name": "Фора 12",
     "text": "Пістолет українського виробництва, призначений в основному для озброєння правоохоронних органів та силових структур. Порівняно із ПМм має кращі влучність бою, зручність у поводженні та ємність магазину. В основному потрапляє до Зони серед"
     "широко презентованих тут відбракованих екземплярів (на загал це ранні зразки з усіма «дитячими хворобами»). Проте все одно має попит серед сталкерів через доволі високі бойові характеристики."
}

UDP_comapact = {
     "name": "УДП Компакт",
     "text": "Пістолет німецького виробництва. Має непогану точність, середню ємкість магазину, при цьому досить надійний."
}

Kora_919 = {
     "name": "Кора-919",
     "text": "Пістолет, шанований багатьма сталкерами за надійність системи, суворо перевіреної часом, і непогані характеристики. Це відмінна зброя, особливо у вмілих руках за належної вправності. Він має один недолік у вигляді малого магазину, який з надлишком компенсується потужністю патрона калібру .45"
}

Marta = {
     "name": "Марта",
     "text": "Пістолет італійського виробництва, доволі потужна зброя. Поширена серед ветеранів багатьох угруповань через свої доволі непогані характеристики бою."
     "Перебуває на озброєнні збройних сил та поліції США, багатьох воєнізованих і правоохоронних формувань в усьому світі. Настільки ж популярна й у представників злочинного світу завдяки потужному патрону 9x19 та великій місткості магазина."
}

Volker_P9m = {
     "name": "Волкер-П9м",
     "text": "Німецький пістолет під патрони 9х19 мм. Непогана влучність та місткий магазин роблять його непоганою зброєю в умілих руках."
     "Використовувати цей пістолет слід, як аналог ПМм, але маючий інший калібр. Малоефективний проти броньованих цілей, але ефективний на коротких дистанціях."
}

SIPT_M200 = {
     "name": "СІП-т м200",
     "text": "Пістолет швейцарського виробництва. Має непогану точність, не дуже високу ємкість магазину, при цьому досить надійний."
}

Black_hawk = {
     "name": "Чорний яструб",
     "text": "Надзвичайно потужний пістолет, рідкісна річ у Зоні. Такий зазвичай мають бандитські «пахани»."
}

Sawed_off_shotgun = {
     "name": "Обріз",
     "text": "Lешева й поширена серед сталкерів та бандитів-новачків зброя.Обріз ефективний лише на малих дистанціях проти слабозахищених ворогів. На відстані більше 5 метрів майже бескорисний."
     "Через малий боєкомплект (2 набої) краще його за першої же можливості замінити на Чейзер-13 або СПСА-14."
}

Hunters_rifle = {
     "name": "Мисливська рушниця",
     "text": "Поширена мисливська рушниця-«вертикалка» завдяки достатній точності та пристойній кінетичній дії забезпечує надійніший захист від мутантів, ніж пістолет. Є дуже дешевою та доступною порівняно із більшістю видів зброї, тому активно застосовується новачками та бандитами на околицях Зони."
}

Chazer = {
     "name": "Чейзер-13",
     "text": "Гладкоствольна помпова рушниця американського виробництва, створена для застосування у дуже несприятливих умовах, тому відзначається високою надійністю. Усі деталі мають антикорозійне покриття. Для спорядження використовуються боєприпаси калібру 12х70."
}

SPSA_14 = {
     "name": "СПСА-14",
     "text": "Гладкоствольну рушницю СПСА14 було розроблено наприкінці 1970-х як універсальну бойову зброю для поліції та штурмових підрозділів армії."
     "Вона відзначається високою надійністю та гнучкістю застосування; з іншого боку, це доволі масивна, складна за конструкцією та дорога зброя. Мабуть, кращого ствола для ближнього бою в Зоні не знайти."
}

Bouncer = {
     "name": "Відбійник",
     "text": "Гладкоствольний бойовий дробовик, розроблений для підвищення вогневої потужності спецпідрозділів армії та поліції. Основні переваги — високі місткість магазину та практична скорострільність; основні недоліки — значні габарити й вага зброї, а також невисока швидкість перезарядки. У Зоні зустрічається рідко і застосовується переважно для зачистки лігвищ мутантів."
}

Gaduka_5 = {
     "name": "Гадюка 5",
     "text": "Гадюка-5 або Viper-5[1] — єдиний пістолет-кулемет в оригінальній трилогії. Дуже популярний на задвірках Зони як надійна, дешева і легка в використанні зброя. Неефективний проти броньованих супротивників, проте ефективний проти дрібних мутантів."
     "Використовує патрони пістолетного калібру, що й визначає клас зброї. Цей патрон має непогану забійність, але низьку бронебійність та настильність. Сам пістолет-кулемет дуже скорострільний та зручний, а також дуже швидко перезаряджається, особливо у ТЧ. Однак влучність залишає бажати кращого."
     "Через це все Гадюка-5 є майже ідеальною зброєю для ближньго бою проти слабо- та взагалі незахищених цілей (мутантів, сталкерів та бандитів-новачків), але 'пасує' як у дальньому бою, так і проти супротивників у важких бронежилетах. Буде ідеальною зброєю для проходження початку гри."
}

AKM_74_2U = {
    "name": "АКМ-74/2У",
     "text" : "АКМ-74/2У (АКМ-74У)[1] — штурмова гвинтівка, вкорочена версія автомату АКМ-74/2. Популярна серед досвідчених сталкерів, а також перебуває на озброєнні військових."
     "За своїми габаритами та масою АКМ-74/2У (укорочений) близький до пістолетів-кулеметів, однак принцип дії механізму цієї зброї та застосовуваний у ньому патрон роблять його представником класу автоматів. До плюсів належать малі габарити, що вкрай корисно під час ведення бою в умовах міста, і досить висока пробивна здатність патрона. Головні мінуси — мала прицільна дальність та схильність до швидкого перегріву під час стрільби чергами."
}

AKM_74_2 = {
    "name": "АКМ-74/2",
     "text" : "АКМ-74/2 — штурмова гвинтівка радянського виробництва. Є досить універсальною зброєю. Одна з найпоширеніших у Зоні."
     "Автомат зразка 1974 року, із появою якого армії країн Варшавського договору почали переходити на малокаліберний патрон із низьким імпульсом віддачі. Масивний компенсатор дозволяє ще більш знизити і без того не надто значну віддачу, й це позитивно впливає на влучність та купності стрільби в усіх режимах ведення вогню. Крім того, це проста за конструкцією та надійна зброя."
}

AS_VAL = {
    "name": "АС ВАЛ",
     "text" : "Створений на базі безшумної снайперської гвинтівки «Гвинтар», від якої відрізняється складаним прикладом, можливістю вести вогонь чергами, а також більш містким магазином. Спочатку призначався для застосування спецпідрозділами в умовах атаки, що вимагає безшумної та безпламенної стрільби."
}

TRS_301 = {
    "name": "ТРС-301",
     "text" : "Легка гвинтівка із дальністю ефективного вогню до 300 м. Завдяки винятково різному спуску, високій ергономіці та невеликій масі ця зброя відзначається високою точністю бою, хоча висока чутливість до забруднення робить її не дуже придатною для використання у складних польових умовах."
}

IL_86 = {
    "name": "ІЛ-86",
     "text" : "Після того, як ця гвинтівка була замінена в армії Великобританії на німецьку ГП-37, вона у великій кількості з’явилася на чорному ринку, а відтак і в Зоні. Головним плюсом ІЛ86 є штатний 4-кратний оптичний приціл і висока влучність першого пострілу. За стрільби чергами влучність бою різко знижується, а надійність основних механізмів гвинтівки є недостатньо високою."
}

Grom_314 = {
    "name": "Грім-314",
     "text" : "Автоматно-гранатометний комплекс, на 70% уніфікований з автоматами типу АКМ-74 (основні відмінності — калібр 9х39 мм, компоновочна схема «бул-пап» та ширші можливості для модернізації). Розроблений для озброєння підрозділів швидкого реагування. Дуже цінується військовими та сталкерами за здатність надійно вражати захищеного бронежилетом або розміщеного в укритті супротивника."
}

Abakan = {
    "name": "Абакан",
     "text" : "АС-96/2 (також «Обокан») — штурмова гвинтівка російського виробництва. Розроблена як сучасна заміна АКМ-74/2. У порівнянні з ним, має покращені характеристики точності та забійності. Гвинтівка широко популярна у Зоні, як надійна, дешева і універсальна зброя."
}

GP_37 = {
    "name": "ГП-37",
     "text" : "Є однією з найкращих штурмових гвинтівок, поступаючись лише ФТ-200М. Причина тому — непогана забійність, вища ніж у СГІ-5к, висока (для штурмової гвинтівки) влучність та мала віддача, а заклинює її набагато рідше ніж, наприклад, ІЛ86 чи ТРс-301. А наявність оптики робить ГП37 найзручнішою для бою на близькій і середній відстанях."
}

SGI_5k = {
    "name": "СГІ-5к",
     "text" : "СГІ-5к — штурмова гвинтівка швейцарського виробництва. Характеризується високою надійністю і непоганою вбивчою силою."
}

FT_200m = {
    "name": "ФТ-200М",
     "text" : "Автоматно-гранатометний комплекс. Має оптичний приціл та підствольний гранатомет. По-своєму ідеальна зброя. Маючи приціл низької кратності і підствольник, ця гвинтівка є досить універсальною зброєю. Є віверто найкращою зброєю в Зоні."
}

VSS_Vintorez = {
    "name": "ВСС Винторез",
     "text" : "Гвинтар-ВС або СГ «Гвинтар» — вогнепальна зброя російського виробництва. Цінується сталкерами завдяки зручності, невеликим габаритам і вазі, а також можливістю вести влучний і тихий бій."
}

SVDM_2 = {
    "name": "СВДм-2",
     "text" : "Цей тип снайперської гвинтівки знаходиться на ринку озброєнь вже добрих півсторіччя і за цей час встиг зарекомендувати себе як винятково надійна та зручна у поводженні зброя. У війську вона слугує у загалі для враження віддалених цілей, котрі неможливо дістати з автомата, але сталкери шанують СВДм-2 багато в чому за те, що куля з неї дозволяє пробити навіть найтовщу шкіру мутанта або гарний бронежилет."
}

SVUMk_2 = {
    "name": "СВУмк-2",
     "text" : "Сучасніший варіант снайперської гвинтівки СВДм-2, в якому для зменшення габаритів використано компоновку «булл-пап». Має вищий порівняно із прототипом бойовий темп вогню за меншої ваги, причому влучність бою на малій та середній дистанціях залишилася приблизно тією ж самою. Наразі користується цілком заслуженою популярністю у військах та серед сталкерів."
}

Gauss_gun = {
    "name": "Гаусс пушка",
     "text" : "Надточну високотехнологічну зброю, відому як «Виріб №62», було розроблено конструкторами секретних лабораторій всередині Зони. Принцип її дії заснований на розгоні кулі системою електромагнітів; куля при цьому здатна розвивати надшвидкості, що забезпечує колосальну пробивну здатність за майже повної відсутності віддачі. Для забезпечення достатньої енергоємності акумуляторів у останніх використовуються частки певних артефактів."
}

Buldog_6 = {
    "name": "Булдог-6",
     "text" : "Використати цю зброю є сенс у декількох випадках: великі скупчення супротивника, бронетехніка (БТР) або особливо живучі мутанти. При цьому не треба забувати про вагу даної зброї а також про рідкісність необхідних бойових зарядів."
}

RPG_7U = {
    "name": "РПГ-7У",
     "text" : "Через особливість використання, РПГ дуже рідко зустрічається у Зоні, здебільшого в руках бійців спеціальних груп. Використовувати його є сенс при боротьбі з великими скупченнями ворога, сильними мутантами або ж при нападі чи захисті якої-небудь бази."
     "Через велику вагу і рідкісність зарядів, не вдасться весь час носити з собою гранатомет і використовувати його при першій можливості. Отже, брати його з собою краще всього на час квестів, у яких треба знищити купу бійців чи сильного мутанта."
     "Якщо закінчаться заряди, краще викинути гранатомет, ніж таскати з собою, адже легше купити/знайти новий, ніж думати, що робити з зайвою вагою у рюкзаку."
}

RGD_5 = {
    "name": "РГД-5",
     "text" : "Наступальна ручна граната із невеликим радіусом ураження скалками. Радіус ураження вибуховою хвилею становить близько 5 м. Часто використовується сталкерами для викурювання мутантів із нір."
}

F_1 = {
    "name": "Ф-1",
     "text" : "Ручна оборонна граната; її осколки здатні пробивати бронежилети середнього ступеня захисту, а вибухова хвиля вражає цілі в радіусі до 7 м. До рук сталкерів зазвичай трапляє у процесі мінових відносин із військовими."
}